/*На сайті repl.it напишіть програму для обчислення значення виразу. При цьому
врахуйте, що на нуль ділити не можна. Ваша програма має здійснювати перевірку
введеного значення змінної х. Якщо вона дорівнюватиме 0, то виведіть повідомлення
про те, що на нуль ділити не можна, інакше здійсніть обчислення і виведіть
результат.*/
#include <iostream>

using namespace std;
int main()
{
  float i = 5, x, ans, temp;
  cout << "Введіть x, щоб дізнатися значення виразу : ";
  cin >> x;

  if (x == 0)
    cout << "На нуль ділити не можна";
  else if (x == 1)
    cout << "Обчисленя: 0.6" << endl;
  else
  {
    while (i != 0)
    {
      temp = x + (1 / x);
      ans = 1 / temp;
      i--;
    }
    cout << "Обчисленя: " << ans << endl;
  }
  return 0;
}
