/*Задача. Задане натуральне число, яке позначає місяць (наприклад: 1 – січень,
..., 4 – квітень, ...). Треба попросити користувача ввести це число і
отримати його в певній змінній. Потім перевірити чи можна цьому числу
покласти у відповідність місяць року (вважається, що в році місяці
пронумеровані з першого по дванадцятий). І, якщо можна, то вивести цей
місяць на екран; якщо ні, то вивести повідомлення, що вказаному числу
не можна покласти у відповідність місяць.*/

// Виконав за допомогою двох методів

// Метод #1
#include <iostream>

using namespace std;
int main() {
  int month;
  cout << "Щоб дізнатися місяць року, введіть число місяця: ";
  cin >> month;

  if (month < 1 || month > 12) 
  {
    cout << "Вказаному числу не можна покласти у відповідність місяць. Спробуйте ще раз";
    return 0;
  } 
  else {
    switch (month) {
      case 1:
        cout << month << " - січень\n";
        break;
      case 2:
        cout << month << " - лютий\n";
        break;
      case 3:
        cout << month << " - березень\n";
        break;
      case 4:
        cout << month << " - квітень\n";
        break;
      case 5:
        cout << month << " - травень\n";
        break;
      case 6:
        cout << month << " - червень\n";
        break;
      case 7:
        cout << month << " - липень\n";
        break;
      case 8:
        cout << month << " - серпень\n";
        break;
      case 9:
        cout << month << " - вересень\n";
        break;
      case 10:
        cout << month << " - жовтень\n";
        break;
      case 11:
        cout << month << " - листопад\n";
        break;
      case 12:
        cout << month << " - грудень\n";
        break;
    }
  }
  return 0;
}

// Метод #2
#include <iostream>

using namespace std;
int main()
{
  int month;
  string numberMonth[] = {
      "січень",
      "лютий",
      "березень",
      "квітень",
      "травень",
      "червень",
      "липень",
      "серпень",
      "вересень",
      "жовтень",
      "листопад",
      "грудень"};

  cout << "Щоб дізнатися місяць року, введіть число місяця: ";
  cin >> month;

  if (month < 1 || month > 12)
  {
    cout << "Вказаному числу не можна покласти у відповідність місяць. Спробуйте ще раз" << endl;
  }
  else
    cout << "Місяць під номером " << month << " - " << numberMonth[month - 1] << endl;

  return 0;
}
