/*Задача. Враховуючи що верста дорівнює приблизно , 1 1,067 , кілометра
напишіть програму щоб вона перетворювала версти в кілометри,. 
Програма має пропонувати користувачу ввести кількість верст і 
вивести на екран скільки це буде кілометрів Відповідь округліть 
до трьох знаків після коми .*/

#include <iostream>

using namespace std;
int main()
{
    float km = 1.067, versta;
    cout << "Введіть версти, щоб дізнатися кілометри: ";
    cin >> versta;
    printf("%.3f \n", versta * km);
}
