/*Користувач вводить з клавіатури ціле число більше нуля, потрібно вивести всі його
цифри, починаючи з кінця. Наприклад, якщо було введено 1234567890, то вивести
треба 0987654321. Підказка: для виконання завдання можна використати цикл з
невідомою наперед кількістю повторів і операції ділення і остачі від ділення.*/
#include <iostream>

using namespace std;
int main()
{
  int number, temp = 0;
  cout << "Введіть: ";
  cin >> number;

  if (number == 0 || number < 0)
    cout << "Введіть число більше нуля ";
  while(number > 0)
  {
    temp = number%10;  
    number = number/10;
    cout << temp;
  }
  return 0;
}
