/* Створіть масив, у якому буде 27 символів англійської абетки і пробіл. 
В нульову позицію запишіть пропуск (пробіл), з першої по двадцять шосту 
запишіть букви англійської абетки. Напишіть програму, яка обчислюватиме 
суму всіх індексів, які відповідають певним буквам для заданого слова. */

#include <iostream>

using namespace std;
int main() {
  int sum = 0;
  string word;

  char alphabet[] = {' ', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h',
                     'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q',
                     'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z'};
  cout << "Введіть слово: ";
  cin >> word;

  for(int i = 0; i < word.size(); i++){
    for(int j = 0; j < 27; j++){
      if(word[i] == alphabet[j]) sum += j;
    }
  }
  cout << "Відповідь: "<< sum;
}
